In [9]:
import pandas as pd

In [10]:
ds = pd.read_csv('document.csv')

In [4]:
ds.isnull().head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,True,False
2,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False,False,False,True,False

In [5]:
ds['Age'].sum()

10050.5

In [6]:
ds.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [7]:
ds.fillna(ds.mode()).head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,B57 B59 B63 B66,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [10]:
ds['Fare'].quantile(0.60) # 60 percentile

21.437519999999996

### `duplicated()`

In [8]:
d = ds.duplicated() # get duplicated rows
d.sum()

0

In [7]:
d = ds.duplicated(subset=['Fare']) # select required columns only for duplicates
d.sum()

248

### `drop_duplicates()`

In [14]:
ds.shape

(418, 11)

In [15]:
removed = ds.drop_duplicates(subset='Fare')
removed.shape

(170, 11)

### `reset_index()`

In [16]:
removed.index[-1]

417

In [17]:
removed.shape[0]

170

In [18]:
removed.reset_index(drop=True, inplace=True)
removed.index[-1]

169